#+STARTUP: showall
#+STARTUP: lognotestate
#+TAGS:
#+SEQ_TODO: TODO STARTED DONE DEFERRED CANCELLED | WAITING DELEGATED APPT
#+DRAWERS: HIDDEN STATE
#+TITLE: classes
#+CATEGORY: 
#+PROPERTY: header-args:sql             :engine postgresql  :exports both :cmdline csc370
#+PROPERTY: header-args:sqlite          :db /path/to/db  :colnames yes
#+PROPERTY: header-args:C++             :results output :flags -std=c++14 -Wall --pedantic -Werror
#+PROPERTY: header-args:R               :results output  :colnames yes


* Constructors

- Any object must be initialized before it can be used

#+BEGIN_SRC C++
class baby_class {
   ...
public:
   baby_class() {
       std::cout << "creating an object" << std::endl;
   }
   ...
}
#+END_SRC

The following example uses a field that is declared static
- static fields are shared by all instances of the class 
- for any other field, each instance has its own value

#+BEGIN_SRC C++ :main no :flags -std=c++14 -Wall --pedantic -Werror :results output :exports both
#include <iostream>
class baby_class {
   static int count; // static fields are shared by all instances of a class
public:
   baby_class() {
       std::cout << "creating an object " << count++ << std::endl;
   }
};

// a static value must be initialized outside the class
int baby_class::count = 0;

int main()
{
   baby_class b1;
   baby_class b2;
   { 
       baby_class b3;
   } 
   return 0;
}

#+END_SRC

#+RESULTS:
#+begin_example
creating an object 0
creating an object 1
creating an object 2
#+end_example

* Destructors

- a function to cleanup 

#+BEGIN_SRC C++
class baby_class {
   ...
public:
   ~baby_class() {
       std::cout << "destroying an object" << std::endl;
   }
   ...
}
#+END_SRC


#+BEGIN_SRC C++ :main no :flags -std=c++14 -Wall --pedantic -Werror :results output :exports both
#include <iostream>
class baby_class {
public:
   static int count;
   baby_class() { std::cout << "creating an object " << count++ << std::endl; }
   ~baby_class() { std::cout << "destroying an object " << --count << std::endl; }
};

// a static value must be initialized outside the class
int baby_class::count = 0;
baby_class global;

int main()
{

   std::cout << "Starting" << std::endl;
   baby_class b1;
   baby_class b2;
   { 
       std::cout << "Count " <<  baby_class::count << std::endl;
        baby_class b3;
       std::cout << "Count " <<  baby_class::count << std::endl;
   } 
   std::cout << "Count " <<  baby_class::count << std::endl;
   std::cout << "Ending" << std::endl;
   return 0;
}

#+END_SRC

#+RESULTS:
#+begin_example
creating an object 0
Starting
creating an object 1
creating an object 2
Count 3
creating an object 3
Count 4
destroying an object 3
Count 3
Ending
destroying an object 2
destroying an object 1
destroying an object 0
#+end_example


